open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_bt_hci.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * NuttX bt_driver_s lower half over the Beken AP-side Bluetooth mailbox IPC.
 * The Beken object owns MB_CHNL_BT_CMD, its pointer-return protocol and its
 * deferred receive thread.  This chip adapter owns only HCI framing and the
 * NuttX driver registration boundary.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_BT_IPC

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/wireless/bluetooth/bt_driver.h>

#include <arch/chip/bk7258_bt_ipc.h>
#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_BT_H4_COMMAND             0x01u
#define BK7258_BT_H4_ACL                 0x02u
#define BK7258_BT_H4_SCO                 0x03u
#define BK7258_BT_H4_EVENT               0x04u

#define BK7258_BT_VENDOR_INIT            0x0001u
#define BK7258_BT_VENDOR_DEINIT          0x0002u
#define BK7258_BT_CONTROL_TIMEOUT_MS     25000u
#define BK7258_BT_CP_IPC_READY_MS        30000u

#define BK7258_BT_COMMAND_HEADER_SIZE    3u
#define BK7258_BT_EVENT_HEADER_SIZE      2u
#define BK7258_BT_ACL_HEADER_SIZE        4u

#define BK7258_BT_L2CAP_HEADER_SIZE      4u
#define BK7258_BT_L2CAP_CID_ATT          0x0004u
#define BK7258_BT_ATT_OP_MTU_REQ         0x02u
#define BK7258_BT_ATT_MTU_REQ_SIZE       3u
#define BK7258_BT_ATT_MAX_LE_MTU         517u
#define BK7258_BT_OP_HOST_BUFFER_SIZE    0x0c33u
#define BK7258_BT_OP_HOST_NUM_COMPLETED  0x0c35u

#define BK7258_BT_EVT_DISCONNECTED       0x05u
#define BK7258_BT_EVT_COMMAND_COMPLETE   0x0eu
#define BK7258_BT_EVT_COMMAND_STATUS     0x0fu
#define BK7258_BT_EVT_LE_META            0x3eu
#define BK7258_BT_SUBEVT_LE_CONNECTED    0x01u
#define BK7258_BT_SUBEVT_LE_ENH_CONNECTED 0x0au

#define BK7258_BT_STATUS_UNSUPPORTED     0x11u
#define BK7258_BT_HOST_BUFFER_EVENT_SIZE 7u

#if defined(CONFIG_BK7258_BT_HOST_BUFFER_SIZE_COMPAT) && \
    !defined(CONFIG_BLUETOOTH_CNTRL_HOST_FLOW_DISABLE)
#  error "Host Buffer Size compatibility requires Host flow control disabled"
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

typedef void (*bk7258_bt_sdk_callback_t)(uint8_t *buffer, uint16_t length);

struct bk7258_bt_hci_s
{
  struct bt_driver_s driver;
  mutex_t            lock;
  sem_t              control_sem;
  struct bk7258_bt_hci_stats_s stats;
  bool               sem_ready;
  uint32_t           state;
  bool               registering;
  bool               registered;
};

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* These functions are exported by the AP SDK's libbk_bluetooth.a.  Keep the
 * declarations local: bt_ipc_core.h is an SDK-private header and is not part
 * of the copied public SDK include bundle.
 */

extern int32_t bt_ipc_init(void);
extern void bt_ipc_hci_send_vendor_cmd(uint8_t *data, uint16_t length);
extern void bt_ipc_hci_send_cmd(uint16_t opcode, uint8_t *data,
                                uint16_t length);
extern void bt_ipc_hci_send_acl_data(uint16_t handle_flags, uint8_t *data,
                                     uint16_t length);
extern void bt_ipc_register_hci_send_callback(
  bk7258_bt_sdk_callback_t callback);
extern void bk7258_os_bt_ipc_init_begin(void);
extern void bk7258_os_bt_ipc_init_end(void);

#if defined(CONFIG_BK7258_BT_IPC_TRACE) || \
    defined(CONFIG_BK7258_BT_CONN_RX_REF_COMPAT) || \
    defined(CONFIG_BK7258_BT_ATT_MTU_COMPAT)
struct bt_conn_s;
#endif

#if defined(CONFIG_BK7258_BT_IPC_TRACE) || \
    defined(CONFIG_BK7258_BT_CONN_RX_REF_COMPAT)
extern void __real_bt_conn_receive(struct bt_conn_s *conn,
                                   struct bt_buf_s *buf, uint8_t flags);
#endif

#ifdef CONFIG_BK7258_BT_CONN_RX_REF_COMPAT
extern void bt_conn_release(struct bt_conn_s *conn);
#endif

#if defined(CONFIG_BK7258_BT_IPC_TRACE) || \
    defined(CONFIG_BK7258_BT_ATT_MTU_COMPAT)
extern void __real_bt_l2cap_receive(struct bt_conn_s *conn,
                                    struct bt_buf_s *buf);
#endif

#ifdef CONFIG_BK7258_BT_IPC_TRACE
extern void __real_bt_l2cap_send(struct bt_conn_s *conn, uint16_t cid,
                                 struct bt_buf_s *buf);
extern void __real_bt_conn_send(struct bt_conn_s *conn,
                                struct bt_buf_s *buf);
extern int __real_bt_send(struct bt_driver_s *driver,
                          struct bt_buf_s *buf);
extern void __real_bt_gatt_connected(struct bt_conn_s *conn);
extern void __real_bt_gatt_disconnected(struct bt_conn_s *conn);
extern struct bt_buf_s *__real_bt_l2cap_create_pdu(
  struct bt_conn_s *conn);
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_bt_open(struct bt_driver_s *driver);
static int bk7258_bt_send(struct bt_driver_s *driver,
                          enum bt_buf_type_e type, void *data,
                          size_t length);
static void bk7258_bt_close(struct bt_driver_s *driver);
static int bk7258_bt_ioctl(struct bt_driver_s *driver, int command,
                           unsigned long argument);

/****************************************************************************
 * Private Data
 ****************************************************************************/

