open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
static struct bk7258_bt_hci_s g_bk7258_bt_hci =
{
  .lock  = NXMUTEX_INITIALIZER,
  .state = BK7258_BT_LIFECYCLE_CLOSED,
};

volatile struct bk7258_bt_lifecycle_diag_s g_bk7258_bt_ap_lifecycle =
{
  .magic   = BK7258_BT_LIFECYCLE_MAGIC,
  .version = BK7258_BT_LIFECYCLE_VERSION,
  .size    = sizeof(struct bk7258_bt_lifecycle_diag_s),
  .state   = BK7258_BT_LIFECYCLE_CLOSED,
#ifdef CONFIG_BK7258_BT_LIFECYCLE_TEST
  .validation_requested = CONFIG_BK7258_BT_LIFECYCLE_TEST_CYCLES,
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static uint16_t bk7258_bt_get_le16(const uint8_t *data)
{
  return (uint16_t)data[0] | (uint16_t)data[1] << 8;
}

#ifdef CONFIG_BK7258_BT_HOST_BUFFER_SIZE_COMPAT
static bool bk7258_bt_accept_host_buffer_size(uint8_t *output,
                                             const uint8_t *input,
                                             size_t length)
{
  if (length != BK7258_BT_HOST_BUFFER_EVENT_SIZE ||
      input[0] != BK7258_BT_H4_EVENT ||
      input[1] != BK7258_BT_EVT_COMMAND_COMPLETE || input[2] != 4u ||
      bk7258_bt_get_le16(&input[4]) != BK7258_BT_OP_HOST_BUFFER_SIZE ||
      input[6] != BK7258_BT_STATUS_UNSUPPORTED)
    {
      return false;
    }

  /* Copy the SDK-owned frame and change only its status byte.  Delivery still
   * waits for the real Controller completion, so NuttX retains the original
   * ncmd credit and sent_cmd ordering.
   */

  memcpy(output, input, length);
  output[6] = 0u;
  return true;
}
#endif

#ifdef CONFIG_BK7258_BT_ATT_MTU_COMPAT
static void bk7258_bt_put_le16(uint8_t *data, uint16_t value)
{
  data[0] = (uint8_t)value;
  data[1] = (uint8_t)(value >> 8);
}
#endif

static uint32_t bk7258_bt_pack_bytes(const uint8_t *data, size_t length)
{
  uint32_t value = 0;
  size_t i;

  if (length > sizeof(value))
    {
      length = sizeof(value);
    }

  for (i = 0; i < length; i++)
    {
      value |= (uint32_t)data[i] << (i * 8u);
    }

  return value;
}

#ifdef CONFIG_BK7258_BT_IPC_TRACE
static void bk7258_bt_trace_att(bool tx, uint16_t cid,
                                const uint8_t *data, size_t length)
{
  struct bk7258_bt_hci_stats_s *stats = &g_bk7258_bt_hci.stats;
  struct bk7258_bt_att_trace_s *entry;
  uint32_t sequence;
  uint32_t meta;

  if (cid != BK7258_BT_L2CAP_CID_ATT || data == NULL)
    {
      return;
    }

  if (length > BK7258_BT_ATT_TRACE_LENGTH_MASK)
    {
      length = BK7258_BT_ATT_TRACE_LENGTH_MASK;
    }

  sequence = __atomic_fetch_add(&stats->host_att_trace_sequence, 1u,
                                __ATOMIC_RELAXED);
  entry = &stats->host_att_trace[sequence % BK7258_BT_ATT_TRACE_DEPTH];
  meta = (tx ? BK7258_BT_ATT_TRACE_TX : 0u) |
         (uint32_t)length << BK7258_BT_ATT_TRACE_LENGTH_SHIFT | cid;

  __atomic_store_n(&entry->data0, bk7258_bt_pack_bytes(data, length),
                   __ATOMIC_RELAXED);
  __atomic_store_n(&entry->data1,
                   length > sizeof(uint32_t) ?
                     bk7258_bt_pack_bytes(data + sizeof(uint32_t),
                                           length - sizeof(uint32_t)) : 0u,
                   __ATOMIC_RELAXED);
  __atomic_store_n(&entry->meta, meta, __ATOMIC_RELEASE);
}
#endif

static void bk7258_bt_count_invalid_rx(struct bk7258_bt_hci_s *priv)
{
  __atomic_fetch_add(&priv->stats.invalid_rx, 1u, __ATOMIC_RELAXED);
}

static void bk7258_bt_control_sem_drain(struct bk7258_bt_hci_s *priv)
{
  while (nxsem_trywait(&priv->control_sem) == OK)
    {
    }
}

static void bk7258_bt_set_state(struct bk7258_bt_hci_s *priv,
                               uint32_t state, int error)
{
  uint32_t previous;

  previous = __atomic_exchange_n(&priv->state, state, __ATOMIC_ACQ_REL);
  __atomic_store_n(&g_bk7258_bt_ap_lifecycle.last_error, error,
                   __ATOMIC_RELAXED);
  __atomic_store_n(&g_bk7258_bt_ap_lifecycle.state, state,
                   __ATOMIC_RELEASE);
  if (state == BK7258_BT_LIFECYCLE_UNKNOWN && state != previous)
    {
      __atomic_fetch_add(&g_bk7258_bt_ap_lifecycle.unknown_transitions, 1u,
                         __ATOMIC_RELAXED);
    }
}

#ifdef CONFIG_BK7258_RPTUN_MBOX
static int bk7258_bt_wait_cp_ipc_ready(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  clock_t start = clock_systime_ticks();
  clock_t timeout = MSEC2TICK(BK7258_BT_CP_IPC_READY_MS);
  uint32_t flags;

  __asm volatile ("dmb sy" ::: "memory");
  if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
      control->version != BK7258_RPTUN_CONTROL_VERSION ||
      control->size != sizeof(*control) ||
      control->generation != state->generation)
    {
      return -EPROTO;
    }

  /* Publish the AP endpoint only after bt_ipc_init() and its receive callback
   * are installed.  CP acknowledges that its matching IPC worker is ready;
   * the vendor-init request below then starts the Controller through the
   * official CP bt_ipc message path.
   */

  __atomic_fetch_or(&control->flags,
                    BK7258_RPTUN_FLAG_AP_BT_IPC_READY,
                    __ATOMIC_RELEASE);

  for (;;)
    {
      flags = __atomic_load_n(&control->flags, __ATOMIC_ACQUIRE);
      if ((flags & BK7258_RPTUN_FLAG_CP_BT_READY) != 0)
        {
          return OK;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (control->magic != BK7258_RPTUN_CONTROL_MAGIC ||
          control->generation != state->generation)
        {
          return -EPROTO;
        }

      if ((clock_t)(clock_systime_ticks() - start) >= timeout)
        {
          return -ETIMEDOUT;
        }

      nxsig_usleep(1000);
    }
}
#endif

static int bk7258_bt_control_request(struct bk7258_bt_hci_s *priv,
                                     uint16_t subopcode)
{
  uint8_t command[2];

  /* Match the vendor SDK wire ABI exactly.  Commands encode the vendor
   * subopcode most-significant byte first; the SDK consumes the matching
   * status event internally and calls bk_bluetooth_init_deinit_compelete().
   */

  command[0] = (uint8_t)(subopcode >> 8);
  command[1] = (uint8_t)subopcode;
  bk7258_bt_control_sem_drain(priv);
  bt_ipc_hci_send_vendor_cmd(command, sizeof(command));

  return nxsem_tickwait_uninterruptible(
           &priv->control_sem,
           MSEC2TICK(BK7258_BT_CONTROL_TIMEOUT_MS));
}

static int bk7258_bt_transition_locked(struct bk7258_bt_hci_s *priv,
                                       uint16_t subopcode,
                                       uint32_t target_state)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  volatile uint32_t *requests;
  volatile uint32_t *successes;
  uint32_t flags;
  bool cp_active;
  int ret;

  if (subopcode == BK7258_BT_VENDOR_INIT)
    {
      requests = &g_bk7258_bt_ap_lifecycle.init_requests;
      successes = &g_bk7258_bt_ap_lifecycle.init_successes;
    }
  else
    {
      requests = &g_bk7258_bt_ap_lifecycle.deinit_requests;
      successes = &g_bk7258_bt_ap_lifecycle.deinit_successes;
    }

  __atomic_fetch_add(requests, 1u, __ATOMIC_RELAXED);
  ret = bk7258_bt_control_request(priv, subopcode);
  flags = __atomic_load_n(&control->flags, __ATOMIC_ACQUIRE);
  cp_active = (flags & BK7258_RPTUN_FLAG_CP_BT_ACTIVE) != 0;
  if (cp_active != (target_state == BK7258_BT_LIFECYCLE_OPEN))
    {
      if (ret >= 0)
        {
          ret = -EIO;
          __atomic_fetch_add(&g_bk7258_bt_ap_lifecycle.status_mismatches,
                             1u, __ATOMIC_RELAXED);
        }

