open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
      bk7258_bt_set_state(priv, BK7258_BT_LIFECYCLE_UNKNOWN, ret);
      return ret;
    }

  /* The CP-owned flag is authoritative.  A lost vendor reply must not make
   * an already committed idempotent transition diverge between AP and CP.
   */

  if (ret < 0)
    {
      __atomic_fetch_add(&g_bk7258_bt_ap_lifecycle.reconciled_timeouts,
                         1u, __ATOMIC_RELAXED);
    }

  __atomic_fetch_add(successes, 1u, __ATOMIC_RELAXED);
  bk7258_bt_set_state(priv, target_state, OK);
  return OK;
}

#ifdef CONFIG_BK7258_BT_LIFECYCLE_TEST
static int bk7258_bt_validate_lifecycle_locked(
  struct bk7258_bt_hci_s *priv)
{
  uint32_t i;
  int ret;

  __atomic_store_n(&g_bk7258_bt_ap_lifecycle.validation_status,
                   -EINPROGRESS, __ATOMIC_RELAXED);
  for (i = 0; i < CONFIG_BK7258_BT_LIFECYCLE_TEST_CYCLES; i++)
    {
      ret = bk7258_bt_transition_locked(priv, BK7258_BT_VENDOR_DEINIT,
                                        BK7258_BT_LIFECYCLE_CLOSED);
      if (ret < 0)
        {
          goto out;
        }

      ret = bk7258_bt_transition_locked(priv, BK7258_BT_VENDOR_INIT,
                                        BK7258_BT_LIFECYCLE_OPEN);
      if (ret < 0)
        {
          goto out;
        }

      __atomic_store_n(&g_bk7258_bt_ap_lifecycle.validation_completed,
                       i + 1u, __ATOMIC_RELAXED);
    }

  ret = OK;

out:
  __atomic_store_n(&g_bk7258_bt_ap_lifecycle.validation_status, ret,
                   __ATOMIC_RELEASE);
  return ret;
}
#endif

static void bk7258_bt_sdk_receive(uint8_t *buffer, uint16_t length)
{
  struct bk7258_bt_hci_s *priv = &g_bk7258_bt_hci;
#ifdef CONFIG_BK7258_BT_HOST_BUFFER_SIZE_COMPAT
  uint8_t host_buffer_event[BK7258_BT_HOST_BUFFER_EVENT_SIZE];
#endif
  enum bt_buf_type_e type;
  uint16_t payload_length;
  int ret;

  /* bt_ipc_core invokes this callback from its bt_ipc_thd worker, then frees
   * buffer as soon as the callback returns.  bt_netdev_receive() copies the
   * complete HCI packet synchronously before deferring stack processing.
   */

  if (__atomic_load_n(&priv->state, __ATOMIC_ACQUIRE) !=
        BK7258_BT_LIFECYCLE_OPEN ||
      buffer == NULL || length < 1 || priv->driver.receive == NULL)
    {
      bk7258_bt_count_invalid_rx(priv);
      return;
    }

  switch (buffer[0])
    {
      case BK7258_BT_H4_EVENT:
        if (length < 1 + BK7258_BT_EVENT_HEADER_SIZE)
          {
            bk7258_bt_count_invalid_rx(priv);
            return;
          }

        payload_length = buffer[2];
        if ((size_t)length != 1 + BK7258_BT_EVENT_HEADER_SIZE +
                              payload_length)
          {
            bk7258_bt_count_invalid_rx(priv);
            return;
          }

#ifdef CONFIG_BK7258_BT_HOST_BUFFER_SIZE_COMPAT
        if (bk7258_bt_accept_host_buffer_size(host_buffer_event, buffer,
                                              length))
          {
            buffer = host_buffer_event;
            syslog(LOG_INFO,
                   "BK7258 BT: accepted unsupported Host Buffer Size "
                   "with Host flow control disabled\n");
          }
#endif

        __atomic_fetch_add(&priv->stats.event_rx, 1u, __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_event_header,
                         (uint32_t)buffer[1] |
                         (uint32_t)payload_length << 8,
                         __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_event_payload,
                         bk7258_bt_pack_bytes(&buffer[3], payload_length),
                         __ATOMIC_RELAXED);
        if (buffer[1] == BK7258_BT_EVT_COMMAND_COMPLETE &&
            payload_length >= 4u)
          {
            __atomic_fetch_add(&priv->stats.hci_cmd_complete, 1u,
                               __ATOMIC_RELAXED);
            __atomic_store_n(
              &priv->stats.last_cmd_complete,
              (uint32_t)bk7258_bt_get_le16(&buffer[4]) |
              (uint32_t)buffer[6] << 16 |
              (uint32_t)buffer[3] << 24,
              __ATOMIC_RELAXED);
          }
        else if (buffer[1] == BK7258_BT_EVT_COMMAND_STATUS &&
                 payload_length >= 4u)
          {
            __atomic_fetch_add(&priv->stats.hci_cmd_status, 1u,
                               __ATOMIC_RELAXED);
            __atomic_store_n(
              &priv->stats.last_cmd_status,
              (uint32_t)bk7258_bt_get_le16(&buffer[5]) |
              (uint32_t)buffer[3] << 16 |
              (uint32_t)buffer[4] << 24,
              __ATOMIC_RELAXED);
          }
        else if (buffer[1] == BK7258_BT_EVT_LE_META &&
                 payload_length >= 4u &&
            (buffer[3] == BK7258_BT_SUBEVT_LE_CONNECTED ||
             buffer[3] == BK7258_BT_SUBEVT_LE_ENH_CONNECTED) &&
            buffer[4] == 0u)
          {
            __atomic_fetch_add(&priv->stats.hci_le_connected, 1u,
                               __ATOMIC_RELAXED);
          }
        else if (buffer[1] == BK7258_BT_EVT_DISCONNECTED &&
                 payload_length >= 4u)
          {
            __atomic_fetch_add(&priv->stats.hci_disconnected, 1u,
                               __ATOMIC_RELAXED);
            __atomic_store_n(
              &priv->stats.last_disconnection,
              (uint32_t)buffer[3] |
              (uint32_t)bk7258_bt_get_le16(&buffer[4]) << 8 |
              (uint32_t)buffer[6] << 24,
              __ATOMIC_RELAXED);
          }
        type = BT_EVT;
        break;

      case BK7258_BT_H4_ACL:
        if (length < 1 + BK7258_BT_ACL_HEADER_SIZE)
          {
            bk7258_bt_count_invalid_rx(priv);
            return;
          }

        payload_length = bk7258_bt_get_le16(&buffer[3]);
        if ((size_t)length != 1 + BK7258_BT_ACL_HEADER_SIZE +
                              payload_length)
          {
            bk7258_bt_count_invalid_rx(priv);
            return;
          }

        __atomic_fetch_add(&priv->stats.acl_rx, 1u, __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_acl_rx,
                         (uint32_t)bk7258_bt_get_le16(&buffer[1]) |
                         (uint32_t)payload_length << 16,
                         __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_acl_rx_payload0,
                         bk7258_bt_pack_bytes(&buffer[5], payload_length),
                         __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_acl_rx_payload1,
                         payload_length > sizeof(uint32_t) ?
                           bk7258_bt_pack_bytes(&buffer[9],
                             payload_length - sizeof(uint32_t)) : 0u,
                         __ATOMIC_RELAXED);
        type = BT_ACL_IN;
        break;

      case BK7258_BT_H4_SCO:
      default:
        bk7258_bt_count_invalid_rx(priv);
        return;
    }

  ret = bt_netdev_receive(&priv->driver, type, buffer + 1, length - 1);
  if (ret < 0)
    {
      __atomic_fetch_add(&priv->stats.receive_errors, 1u,
                         __ATOMIC_RELAXED);
    }
}

static int bk7258_bt_open(struct bt_driver_s *driver)
{
  struct bk7258_bt_hci_s *priv = (struct bk7258_bt_hci_s *)driver;
  uint32_t initial_state;
  int32_t sdkret;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  initial_state = __atomic_load_n(&priv->state, __ATOMIC_ACQUIRE);
  if (initial_state == BK7258_BT_LIFECYCLE_OPEN)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  bt_ipc_register_hci_send_callback(bk7258_bt_sdk_receive);
  bk7258_os_bt_ipc_init_begin();
  sdkret = bt_ipc_init();
  bk7258_os_bt_ipc_init_end();
  if (sdkret != 0 && sdkret != 1)
    {
      if (initial_state == BK7258_BT_LIFECYCLE_CLOSED)
        {
          bt_ipc_register_hci_send_callback(NULL);
        }

      nxmutex_unlock(&priv->lock);
      return -EIO;
    }

#ifdef CONFIG_BK7258_RPTUN_MBOX
  ret = bk7258_bt_wait_cp_ipc_ready();
  if (ret < 0)
    {
      if (initial_state == BK7258_BT_LIFECYCLE_CLOSED)
        {
          bt_ipc_register_hci_send_callback(NULL);
        }

      nxmutex_unlock(&priv->lock);
      return ret;
    }
#endif

