open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
  ret = bk7258_bt_transition_locked(priv, BK7258_BT_VENDOR_INIT,
                                    BK7258_BT_LIFECYCLE_OPEN);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return ret;
    }

#ifdef CONFIG_BK7258_BT_LIFECYCLE_TEST
  if (__atomic_load_n(&g_bk7258_bt_ap_lifecycle.validation_completed,
                      __ATOMIC_ACQUIRE) == 0u)
    {
      ret = bk7258_bt_validate_lifecycle_locked(priv);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->lock);
          return ret;
        }
    }
#endif

  nxmutex_unlock(&priv->lock);
  return OK;
}

static int bk7258_bt_send(struct bt_driver_s *driver,
                          enum bt_buf_type_e type, void *data, size_t length)
{
  struct bk7258_bt_hci_s *priv = (struct bk7258_bt_hci_s *)driver;
  uint8_t *packet = data;
  uint16_t payload_length;
  uint16_t value;

  if (__atomic_load_n(&priv->state, __ATOMIC_ACQUIRE) !=
      BK7258_BT_LIFECYCLE_OPEN)
    {
      return -ENETDOWN;
    }

  if (packet == NULL)
    {
      return -EINVAL;
    }

  switch (type)
    {
      case BT_CMD:
        if (length < BK7258_BT_COMMAND_HEADER_SIZE)
          {
            return -EMSGSIZE;
          }

        payload_length = packet[2];
        if (length != BK7258_BT_COMMAND_HEADER_SIZE + payload_length)
          {
            return -EMSGSIZE;
          }

        value = bk7258_bt_get_le16(packet);
#ifdef CONFIG_BLUETOOTH_CNTRL_HOST_FLOW_DISABLE
        /* NuttX releases every BT_ACL_IN buffer by issuing Host Number Of
         * Completed Packets even when Controller-to-Host flow control was
         * disabled during HCI initialization.  BK7258 returns a non-standard
         * Command Complete (status 0x07, ncmd 0) for that command; enough ATT
         * traffic then consumes the command credit and prevents the stock
         * disconnect path from re-enabling advertising.  The Controller was
         * explicitly told not to use Host flow control, so drop only this
         * now-unnecessary acknowledgement at the chip adapter boundary.
         */

        if (value == BK7258_BT_OP_HOST_NUM_COMPLETED)
          {
            __atomic_fetch_add(
              &priv->stats.host_num_completed_dropped, 1u,
              __ATOMIC_RELAXED);
            return OK;
          }
#endif
        __atomic_fetch_add(&priv->stats.command_tx, 1u, __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_command,
                         (uint32_t)value | (uint32_t)payload_length << 16,
                         __ATOMIC_RELAXED);
        bt_ipc_hci_send_cmd(value,
                            packet + BK7258_BT_COMMAND_HEADER_SIZE,
                            payload_length);
        return OK;

      case BT_ACL_OUT:
        if (length < BK7258_BT_ACL_HEADER_SIZE)
          {
            return -EMSGSIZE;
          }

        payload_length = bk7258_bt_get_le16(&packet[2]);
        if (length != BK7258_BT_ACL_HEADER_SIZE + payload_length)
          {
            return -EMSGSIZE;
          }

        value = bk7258_bt_get_le16(packet);
        __atomic_fetch_add(&priv->stats.acl_tx, 1u, __ATOMIC_RELAXED);
        __atomic_store_n(&priv->stats.last_acl_tx,
                         (uint32_t)value | (uint32_t)payload_length << 16,
                         __ATOMIC_RELAXED);
        bt_ipc_hci_send_acl_data(value,
                                 packet + BK7258_BT_ACL_HEADER_SIZE,
                                 payload_length);
        return OK;

      case BT_ISO_OUT:
      default:
        return -EOPNOTSUPP;
    }
}

static void bk7258_bt_close(struct bt_driver_s *driver)
{
  struct bk7258_bt_hci_s *priv = (struct bk7258_bt_hci_s *)driver;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return;
    }

  if (__atomic_load_n(&priv->state, __ATOMIC_ACQUIRE) !=
      BK7258_BT_LIFECYCLE_CLOSED)
    {
      if (bk7258_bt_transition_locked(priv, BK7258_BT_VENDOR_DEINIT,
                                      BK7258_BT_LIFECYCLE_CLOSED) < 0)
        {
          syslog(LOG_ERR,
                 "bk7258: Bluetooth Controller close is uncertain\n");
          bt_ipc_register_hci_send_callback(NULL);
          nxmutex_unlock(&priv->lock);
          return;
        }
    }

  bt_ipc_register_hci_send_callback(NULL);
  nxmutex_unlock(&priv->lock);
}

static int bk7258_bt_ioctl(struct bt_driver_s *driver, int command,
                           unsigned long argument)
{
  (void)driver;
  (void)command;
  (void)argument;
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/* This misspelled symbol is the callback ABI exported by the official AP
 * bt_ipc_core object.  It is called only for a successful controller init or
 * deinit vendor response, from bt_ipc_thd rather than mailbox interrupt
 * context.
 */

void bk_bluetooth_init_deinit_compelete(void)
{
  struct bk7258_bt_hci_s *priv = &g_bk7258_bt_hci;

  if (__atomic_load_n(&priv->sem_ready, __ATOMIC_ACQUIRE))
    {
      nxsem_post(&priv->control_sem);
    }
}

int bk7258_bt_hci_initialize(void)
{
  struct bk7258_bt_hci_s *priv = &g_bk7258_bt_hci;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->registered)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  if (priv->registering)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  if (!__atomic_load_n(&priv->sem_ready, __ATOMIC_ACQUIRE))
    {
      ret = nxsem_init(&priv->control_sem, 0, 0);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->lock);
          return ret;
        }

      __atomic_store_n(&priv->sem_ready, true, __ATOMIC_RELEASE);
    }

  priv->registering         = true;
  priv->driver.head_reserve = 0;
  priv->driver.open         = bk7258_bt_open;
  priv->driver.send         = bk7258_bt_send;
  priv->driver.close        = bk7258_bt_close;
  priv->driver.ioctl        = bk7258_bt_ioctl;
  nxmutex_unlock(&priv->lock);

