open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
  /* bt_driver_register() enters bt_initialize() synchronously, which calls
   * bk7258_bt_open().  Do not hold priv->lock across this call.
   */

  ret = bt_driver_register(&priv->driver);
  if (ret < 0)
    {
      bk7258_bt_close(&priv->driver);

      nxmutex_lock(&priv->lock);
      priv->registering = false;
      if (__atomic_load_n(&priv->state, __ATOMIC_ACQUIRE) ==
          BK7258_BT_LIFECYCLE_CLOSED)
        {
          __atomic_store_n(&priv->sem_ready, false, __ATOMIC_RELEASE);
          nxsem_destroy(&priv->control_sem);
        }

      nxmutex_unlock(&priv->lock);
      return ret;
    }

  nxmutex_lock(&priv->lock);
  priv->registered = true;
  priv->registering = false;
  nxmutex_unlock(&priv->lock);
  return OK;
}

int bk7258_bt_hci_get_stats(struct bk7258_bt_hci_stats_s *stats)
{
  struct bk7258_bt_hci_stats_s *source = &g_bk7258_bt_hci.stats;
  unsigned int i;

  if (stats == NULL)
    {
      return -EINVAL;
    }

  stats->command_tx =
    __atomic_load_n(&source->command_tx, __ATOMIC_RELAXED);
  stats->acl_tx = __atomic_load_n(&source->acl_tx, __ATOMIC_RELAXED);
  stats->event_rx = __atomic_load_n(&source->event_rx, __ATOMIC_RELAXED);
  stats->acl_rx = __atomic_load_n(&source->acl_rx, __ATOMIC_RELAXED);
  stats->invalid_rx =
    __atomic_load_n(&source->invalid_rx, __ATOMIC_RELAXED);
  stats->receive_errors =
    __atomic_load_n(&source->receive_errors, __ATOMIC_RELAXED);
  stats->last_command =
    __atomic_load_n(&source->last_command, __ATOMIC_RELAXED);
  stats->last_acl_tx =
    __atomic_load_n(&source->last_acl_tx, __ATOMIC_RELAXED);
  stats->last_event_header =
    __atomic_load_n(&source->last_event_header, __ATOMIC_RELAXED);
  stats->last_event_payload =
    __atomic_load_n(&source->last_event_payload, __ATOMIC_RELAXED);
  stats->last_acl_rx =
    __atomic_load_n(&source->last_acl_rx, __ATOMIC_RELAXED);
  stats->last_acl_rx_payload0 =
    __atomic_load_n(&source->last_acl_rx_payload0, __ATOMIC_RELAXED);
  stats->last_acl_rx_payload1 =
    __atomic_load_n(&source->last_acl_rx_payload1, __ATOMIC_RELAXED);
  stats->host_conn_rx =
    __atomic_load_n(&source->host_conn_rx, __ATOMIC_RELAXED);
  stats->host_l2cap_rx =
    __atomic_load_n(&source->host_l2cap_rx, __ATOMIC_RELAXED);
  stats->host_l2cap_tx =
    __atomic_load_n(&source->host_l2cap_tx, __ATOMIC_RELAXED);
  stats->host_conn_tx =
    __atomic_load_n(&source->host_conn_tx, __ATOMIC_RELAXED);
  stats->host_bt_send_acl =
    __atomic_load_n(&source->host_bt_send_acl, __ATOMIC_RELAXED);
  stats->host_bt_send_errors =
    __atomic_load_n(&source->host_bt_send_errors, __ATOMIC_RELAXED);
  stats->last_l2cap_rx =
    __atomic_load_n(&source->last_l2cap_rx, __ATOMIC_RELAXED);
  stats->last_l2cap_tx =
    __atomic_load_n(&source->last_l2cap_tx, __ATOMIC_RELAXED);
  stats->host_gatt_connected =
    __atomic_load_n(&source->host_gatt_connected, __ATOMIC_RELAXED);
  stats->host_gatt_disconnected =
    __atomic_load_n(&source->host_gatt_disconnected, __ATOMIC_RELAXED);
  stats->host_pdu_alloc =
    __atomic_load_n(&source->host_pdu_alloc, __ATOMIC_RELAXED);
  stats->host_pdu_fail =
    __atomic_load_n(&source->host_pdu_fail, __ATOMIC_RELAXED);
  stats->host_mtu_clamped =
    __atomic_load_n(&source->host_mtu_clamped, __ATOMIC_RELAXED);
  stats->last_mtu_clamp =
    __atomic_load_n(&source->last_mtu_clamp, __ATOMIC_RELAXED);
  stats->hci_cmd_complete =
    __atomic_load_n(&source->hci_cmd_complete, __ATOMIC_RELAXED);
  stats->hci_cmd_status =
    __atomic_load_n(&source->hci_cmd_status, __ATOMIC_RELAXED);
  stats->last_cmd_complete =
    __atomic_load_n(&source->last_cmd_complete, __ATOMIC_RELAXED);
  stats->last_cmd_status =
    __atomic_load_n(&source->last_cmd_status, __ATOMIC_RELAXED);
  stats->host_num_completed_dropped =
    __atomic_load_n(&source->host_num_completed_dropped,
                    __ATOMIC_RELAXED);
  stats->hci_le_connected =
    __atomic_load_n(&source->hci_le_connected, __ATOMIC_RELAXED);
  stats->hci_disconnected =
    __atomic_load_n(&source->hci_disconnected, __ATOMIC_RELAXED);
  stats->last_disconnection =
    __atomic_load_n(&source->last_disconnection, __ATOMIC_RELAXED);
  stats->host_att_trace_sequence =
    __atomic_load_n(&source->host_att_trace_sequence, __ATOMIC_ACQUIRE);
  for (i = 0; i < BK7258_BT_ATT_TRACE_DEPTH; i++)
    {
      stats->host_att_trace[i].meta =
        __atomic_load_n(&source->host_att_trace[i].meta, __ATOMIC_ACQUIRE);
      stats->host_att_trace[i].data0 =
        __atomic_load_n(&source->host_att_trace[i].data0, __ATOMIC_RELAXED);
      stats->host_att_trace[i].data1 =
        __atomic_load_n(&source->host_att_trace[i].data1, __ATOMIC_RELAXED);
    }

  return OK;
}

#if defined(CONFIG_BK7258_BT_IPC_TRACE) || \
    defined(CONFIG_BK7258_BT_CONN_RX_REF_COMPAT)
void __wrap_bt_conn_receive(struct bt_conn_s *conn, struct bt_buf_s *buf,
                            uint8_t flags)
{
  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_conn_rx, 1u,
                     __ATOMIC_RELAXED);
  __real_bt_conn_receive(conn, buf, flags);

#ifdef CONFIG_BK7258_BT_CONN_RX_REF_COMPAT
  /* hci_acl() obtained this caller-owned reference with
   * bt_conn_lookup_handle().  The current stock NuttX path does not release
   * it after bt_conn_receive() returns.  Keep this paired release behind a
   * source-verified compatibility option so an upstream ownership change
   * cannot silently become a double release.
   */

  bt_conn_release(conn);
#endif
}
#endif

#if defined(CONFIG_BK7258_BT_IPC_TRACE) || \
    defined(CONFIG_BK7258_BT_ATT_MTU_COMPAT)
void __wrap_bt_l2cap_receive(struct bt_conn_s *conn, struct bt_buf_s *buf)
{
  uint32_t value = 0;

  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_l2cap_rx, 1u,
                     __ATOMIC_RELAXED);
  if (buf != NULL && buf->len >= 4u)
    {
      uint16_t l2cap_length = bk7258_bt_get_le16(buf->data);
      uint16_t cid = bk7258_bt_get_le16(buf->data + 2);
#ifdef CONFIG_BK7258_BT_IPC_TRACE
      size_t att_length = buf->len - BK7258_BT_L2CAP_HEADER_SIZE;

      if (att_length > l2cap_length)
        {
          att_length = l2cap_length;
        }
#endif

      value = (uint32_t)cid | (uint32_t)l2cap_length << 16;
#ifdef CONFIG_BK7258_BT_IPC_TRACE
      bk7258_bt_trace_att(false, cid,
                          buf->data + BK7258_BT_L2CAP_HEADER_SIZE,
                          att_length);
#endif

#ifdef CONFIG_BK7258_BT_ATT_MTU_COMPAT
      if (buf->len >= BK7258_BT_L2CAP_HEADER_SIZE +
                      BK7258_BT_ATT_MTU_REQ_SIZE &&
          bk7258_bt_get_le16(buf->data) == BK7258_BT_ATT_MTU_REQ_SIZE &&
          bk7258_bt_get_le16(buf->data + 2) == BK7258_BT_L2CAP_CID_ATT &&
          buf->data[BK7258_BT_L2CAP_HEADER_SIZE] ==
            BK7258_BT_ATT_OP_MTU_REQ)
        {
          uint8_t *mtu_data = buf->data + BK7258_BT_L2CAP_HEADER_SIZE + 1u;
          uint16_t peer_mtu = bk7258_bt_get_le16(mtu_data);

          if (peer_mtu > BK7258_BT_ATT_MAX_LE_MTU)
            {
              bk7258_bt_put_le16(mtu_data, BK7258_BT_ATT_MAX_LE_MTU);
              __atomic_fetch_add(
                &g_bk7258_bt_hci.stats.host_mtu_clamped, 1u,
                __ATOMIC_RELAXED);
              __atomic_store_n(
                &g_bk7258_bt_hci.stats.last_mtu_clamp,
                (uint32_t)peer_mtu << 16 | BK7258_BT_ATT_MAX_LE_MTU,
                __ATOMIC_RELAXED);
            }
        }
#endif
    }

  __atomic_store_n(&g_bk7258_bt_hci.stats.last_l2cap_rx, value,
                   __ATOMIC_RELAXED);
  __real_bt_l2cap_receive(conn, buf);
}
#endif

#ifdef CONFIG_BK7258_BT_IPC_TRACE

