open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_bt_hci.c
void __wrap_bt_l2cap_send(struct bt_conn_s *conn, uint16_t cid,
                          struct bt_buf_s *buf)
{
  uint32_t length = buf == NULL ? 0u : (uint32_t)buf->len;

  if (buf != NULL)
    {
      bk7258_bt_trace_att(true, cid, buf->data, buf->len);
    }

  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_l2cap_tx, 1u,
                     __ATOMIC_RELAXED);
  __atomic_store_n(&g_bk7258_bt_hci.stats.last_l2cap_tx,
                   (length << 16) | cid, __ATOMIC_RELAXED);
  __real_bt_l2cap_send(conn, cid, buf);
}

void __wrap_bt_conn_send(struct bt_conn_s *conn, struct bt_buf_s *buf)
{
  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_conn_tx, 1u,
                     __ATOMIC_RELAXED);
  __real_bt_conn_send(conn, buf);
}

int __wrap_bt_send(struct bt_driver_s *driver, struct bt_buf_s *buf)
{
  bool acl = buf != NULL && buf->type == BT_ACL_OUT;
  int ret;

  if (acl)
    {
      __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_bt_send_acl, 1u,
                         __ATOMIC_RELAXED);
    }

  ret = __real_bt_send(driver, buf);
  if (acl && ret < 0)
    {
      __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_bt_send_errors, 1u,
                         __ATOMIC_RELAXED);
    }

  return ret;
}

void __wrap_bt_gatt_connected(struct bt_conn_s *conn)
{
  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_gatt_connected, 1u,
                     __ATOMIC_RELAXED);
  __real_bt_gatt_connected(conn);
}

void __wrap_bt_gatt_disconnected(struct bt_conn_s *conn)
{
  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_gatt_disconnected, 1u,
                     __ATOMIC_RELAXED);
  __real_bt_gatt_disconnected(conn);
}

struct bt_buf_s *__wrap_bt_l2cap_create_pdu(struct bt_conn_s *conn)
{
  struct bt_buf_s *buf;

  __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_pdu_alloc, 1u,
                     __ATOMIC_RELAXED);
  buf = __real_bt_l2cap_create_pdu(conn);
  if (buf == NULL)
    {
      __atomic_fetch_add(&g_bk7258_bt_hci.stats.host_pdu_fail, 1u,
                         __ATOMIC_RELAXED);
    }

  return buf;
}
#endif

#endif /* CONFIG_BK7258_BT_IPC */
